app/Controllers/CandidatureController.php

SELECT *
FROM `offres`
WHERE `offres`.`deleted_at` IS NULL
AND `offres`.`id` = '1'
---
    public function apply($offreId)
    {
        $offreModel = new OffreModel();
        $data['offre'] = $offreModel->find($offreId);

SELECT *
FROM `offres`
WHERE `offres`.`deleted_at` IS NULL
AND `offres`.`id` = '2'
---
    public function accepter($id)
    {
        $candidatureModel = new CandidatureModel();
        $offreModel = new OffreModel();

        $candidature = $candidatureModel->find($id);

        if ($candidature) {
            $offre = $offreModel->find($candidature->offre_id);