app/Controllers/EmployeeController.php

    public function index()
    {
        // Fetch all employees from the model
        $data['employees'] = $this->employeeModel->findAll();
---
SELECT *
FROM `employees`

    public function add()
    {
        // Get the form data
        $data = $this->request->getPost();

        // Validate form data (you can customize the validation rules)
        if ($this->validate([
            'name'      => 'required|max_length[100]',
            'email'     => 'required|valid_email|max_length[100]',
            'position'  => 'required|max_length[50]',
            'phone'     => 'permit_empty|max_length[20]',
            'status'    => 'permit_empty|max_length[20]',
        ])) {
            // Insert the employee into the database
            $this->employeeModel->insert($data);
---
INSERT INTO `employees` (`name`, `email`, `position`, `department`, `phone`, `status`) VALUES ('hicham', 'ilyassbenzineb@gmail.com', 'Dev', 'Tech', '0636950188', 'Inactive')

    public function edit($id)
    {
        $data['employee'] = $this->employeeModel->find($id);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '2'

    public function update($id)
    {
        $data = $this->request->getPost();

        if ($this->employeeModel->update($id, $data)) {
---
UPDATE `employees` SET `name` = 'hicham', `email` = 'ilyassbenzineb@gmail.com', `position` = 'Dev', `department` = 'Tech', `phone` = '0636950188', `status` = 'Active'
WHERE `employees`.`id` IN ('2')

    public function delete($id)
    {
        if ($this->employeeModel->delete($id)) {
---
DELETE FROM `employees`
WHERE `id` IN ('1')