app/Controllers/GestionOffreController.php

SELECT *
FROM `offres`
WHERE `offres`.`deleted_at` IS NULL
---
    public function index()
    {
        // Load the model
        $offreModel = new OffreModel();

        // Fetch all offers from the database
        $data['offres'] = $offreModel->findAll();

INSERT INTO `offres` (`titre`, `description`, `type`, `salaire`, `created_at`, `updated_at`) VALUES ('Frontend', 'Le poste de développeur frontend se concentre sur la création et l\'optimisation de l\'interface utilisateur d\'une application web. ', 'CDD', '600000', '2024-11-14 11:48:29', '2024-11-14 11:48:29')
---
    public function store()
    {
        $model = new OffreModel();

        // Validate input fields
        if ($this->validate([
            'titre' => 'required|min_length[3]',
            'description' => 'required|min_length[10]',
            'type' => 'required',
            'salaire' => 'required|numeric',
        ])) {
            // Gather data from POST request
            $data = [
                'titre' => $this->request->getPost('titre'),
                'description' => $this->request->getPost('description'),
                'type' => $this->request->getPost('type'),
                'salaire' => $this->request->getPost('salaire'),
            ];

            // Insert data into the database
            $model->insert($data);

SELECT *
FROM `offres`
WHERE `offres`.`deleted_at` IS NULL
AND `offres`.`id` = '23'
---
    public function edit($id)
{
    $model = new OffreModel();
    $offre = $model->find($id);  // Fetch offer by ID