app/Controllers/loading_pageController.php

SELECT *
FROM `offres`
WHERE `offres`.`deleted_at` IS NULL
---
    public function index()
{
    $model = new OffreModel();
    $data['offres'] = $model->findAll();