app/Controllers/OffreController.php

SELECT *
FROM `offres`
WHERE `offres`.`deleted_at` IS NULL
---
    public function index()
    {
        $offreModel = new OffreModel();

        // Récupérer toutes les offres depuis la base de données
        $offres = $offreModel->findAll();